Tekla Open API Reference for Tekla Structures 2025
CustomPart Constructor (Point, Point)
 Creates a new custom part instance with the given input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomPart(
	Point StartPoint,
	Point EndPoint
)
Public Sub New (
	StartPoint As Point,
	EndPoint As Point
)
Parameters
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point of the custom part.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The end point of the custom part.
See Also
Reference
CustomPart Class
CustomPart Overload
Tekla.Structures.Model Namespace